<template>
    <div class="article-container">
      <h1 class="title">体育锻炼</h1>
      <div class="font-size-controls">
        调整字体大小：
        <button @click="decreaseFontSize">-</button>
        <button @click="increaseFontSize">+</button>
      </div>
      <div class="content" :style="{ fontSize: fontSize + 'px' }">
<h3>1.去户外运动</h3>
<p>有研究显示，花时间贴近大自然有益于你的大脑和整体健康。进行户外运动被证实能够减少压力，增强创造性和提升解决问题的能力，能使你精神更加集中，并且将负面情绪最小化。户外运动(尤其是早晨进行)还有一个很重要的好处，就是可以让你的眼睛接收到更多阳光的照射，有助于维持健康的昼夜节律，从而睡得更好!</p>

<h3>2.增加走步锻炼</h3>
<p>走步是最简单的有氧运动，一定程度上也是一种力量训练——可以把走步想象成携带自身重量作平面运动。行走锻炼是带着目标的训练，而不是随意闲适的乱晃。行走时，可以想象自己马上就要迟到，以这样的节奏强度来行走。当然，走步锻炼也要根据自身的身体情况来调整，你可能一开始的时候强度和速度都不行，慢一点也不要紧。不过，对于走步这种强度不是很大的运动，你最好每天都能进步一点点——每天都要比昨天坚持多走几分钟，直到你能一次性走步30分钟以上。</p>
<p>以下是充分利用走步锻炼时间的一点小建议：</p>
<p>·和朋友一起走步</p>
<p>·提高走步速度</p>
<p>·配合音乐锻炼</p>
<p>·健身的同时健脑：将健身训练纳入每天的走步计划，走步的同时可以尝试倒背英文字母表</p>
<p>·燃烧脂肪的同时进行学习</p>
<p>·使用负重背心</p>
<p>·加上弓步行走动作</p>
<p>·养只宠物狗作为陪伴</p>
<p>·用电子设备等跟踪锻炼进度</p>

<h3>3.利用弹力带进行徒手力量训练</h3>
<p>弹力带(或称为阻力带)是一种徒手力量锻炼(不用在家买一大堆健身器材或是去健身房办卡)的极佳方式。弹力带很便宜，且轻巧便携，不用时可收纳起来，尤其适合那些需经常出差的人。从本质上说，弹力带就是一根粗大的橡胶制带状物,被加工成多种规格，每种规格提供的阻力不尽相同，以此来迎合不同水平的健身人士。弹力带的使用方式也不尽相同，既可以用来模拟器械训练，也可以用来辅助自重训练。</p>

<h3>4.充分驾驭自身的身心链接</h3>
<p>瑜伽与普拉提都能舒解压力，提升身体的柔韧性与平衡性，增强整体力量。瑜伽侧重于身体柔韧性以及大肌群的锻炼，并且带有一些精神元素;而普拉提则更多的着力于身体控制、肌肉的美观和核心力量训练。当然，无论哪项运动都需要强力的心身链接，而心身链接已被研究证实可以提升认知能力，并改善其他健康参数。气功与太极也是不错的选择，它们都带有一些冥想的成分(可以舒缓压力)，同样需要强力的心身链接。一些瑜伽姿势甚至可以惊人的方式促进神经系统的保护。拉姆汗博士是一名神经科学家，也是一名经验丰富的瑜伽修炼者，他提出练习一些平缓的倒立姿势，如瑜伽中的下犬式，可以激活大脑类淋巴系统。</p>

<h3>5.进行跳跃运动</h3>
<p>一项有趣的锻炼项目是蹦床弹跳。蹦床弹跳的动作很简单，就是单纯地跳起，然后落在一个小蹦床上面。它虽然动作简单，却对健康大有裨益，其中最重要的益处就是可以激活淋巴循环系统，从而促进脑中有害物质的清除。</p>
<p>如果你担心在小蹦床上失去平衡，那么，切记要买那种带有平衡杆的小蹦床;若你存在着膀胱控制方面的问题，那么,在进行蹦床弹跳运动之前要记得将尿液排空;如感不适，最好时不时地休息一下。</p>
<p>健康与安全是蹦床跳运动的基石。因此，在开始锻炼之前，切记要保证小蹦床与地面的牢固连接。在起跳之前一定要做好充分准备，跳起时保持双脚离地十几厘米即可。蹦跳的节奏自行把握，跳快跳慢随你，但前提是要保证15分钟的稳定蹦跳锻炼时间。进行一段时间的蹦跳锻炼后，相信你的熟练度也会有相应的提高，此时你可以增加更多的“花样”，比如开合跳、高抬腿、弯腰跳跃，以及原地小跑等。</p>

<h3>6.增强腿部的肌力</h3>
<p> 一项有趣的研究发现:根据人的腿部力量，可以准确地预测认知衰老程度与整体大脑容量。从这个结论出发，若你做腿举锻炼的时候能够承受更大的重量，预示着你随后10年里认知测试得分会比一般人要高，大脑容量更大，认知衰老的进程也会更慢。</p>
<p>如果你的腿部力量比较弱，没关系，你可以先找来一把椅子，然后屁股对着椅子蹲下去，就好像你打算坐在上面那样，但是屁股不可以触碰到椅子，并保持蹲坐的姿势，能蹲坐多久就蹲坐多久。此时，你会发现你大腿正面的肌肉，即股四头肌，会有一种灼热的紧绷感。如果坚持不住了，屁股落到椅子上也不要紧(这就是为什么我们一开始要拿把椅子来练习)，随后再以同样的姿势蹲坐，把这个动作反复做5次，将其作为一组:短暂休息之后再接着进行下一组的训练。过不了多久，你的腿部肌肉就会变得更加强壮!建议每天做满3组，即15个蹲坐。</p>
<img src="/images/yd.jpg"/>
<h3>7.高强度间歇训练法</h3>
<p>高强度间歇训练法对那些有一些锻炼功底，想要改变锻炼模式，或是没有锻炼时间的人说相当不错。HIIT是密集的、高频率的短时爆发力训练，两组高强度训练中间穿插一小段休息和恢复时段。HIIT的锻炼方式旨在在较短时间内将你的肌肉与心肺功能推到最高负荷。典型的HIIT训练流程，用时是非常短的，通常连30分钟都不到。当然，训练时长也要根据你的训练水平来定。从健康收益角度来看，HIIT能在更短的时间里，达到和传统锻炼方式相同的效果，比如减肥，降低静息心率与血压。另外，比起传统形式的锻炼，HIIT在降血糖与增加胰岛素敏感度方面效果更好。最重要的是， HIIT已被证明能够提升老年人群的认知能力，提升幅度最大的是变速处理能力，其次是记忆与执行功能。</p>

<h3>8.氧气治疗呼吸训练</h3>
<p>这项锻炼对于那些有心脑血管病史者，或高危人群而言尤其具有帮助作用。EWOT训练有很多功效，最大的功效在于能够改善脑部以及周围神经系统的循环功能”)。EWOT训练时使用的供氧面具是特别定制的，它至少能够提供8~10 L/min流速的纯氧气体(纯度90%~95%)，以支持你进行一定时长的锻炼。鉴于人们不可能背着供氧设备做室外运动，因此氧疗运动只适合固定的跑步机，或是固定单车(动感单车)。我们认为，每周3次，每次15分钟的氧疗运动是比较合理的，当然这也要根据你自身的情况来定。</p>

<h3>9.采取综合训练方式</h3>
<p>虽然走步锻炼上面介绍了很多，但说实话，没必要将锻炼形式单单拘泥于每天走步。锻炼在于乐趣，锻炼在于新鲜!此时，交叉训练法就极为重要了，即通过切换锻炼动作来达到激活身体各个肌群的效果。基于这个理念，你可以考虑一下加入附近的健身房、YMCAO，或是社区中心举办的力量训练团体课。与一个能满足你锻炼目标的训练者一起锻炼也不失为一个好主意。组团锻炼往往更有趣，气氛更活跃，团队协作的紧密联系对认知健康也更为有益。</p>
<p>可供选择的体育项目有游泳、拳击、打乒乓球、匹克球与尊巴健身操等等。不同的环境有不同的选择，如生活在北方严寒地区，雪鞋行走是一项极佳的锻炼；如果居住在傍水之地，划皮划艇也是个不错的选择。</p>

<h3>>10.克服身体限制</h3>
<p>瑜伽与普拉提对于那些暂时或长期身体行动不便的人来说尤其有益，它们的大多数动作都是在地板上铺着的软垫上完成的。因此，足部、脚踝、膝盖或臀部的问题与旧伤等不太会影响瑜伽与普拉提的这些运动。</p>
<p>气功和太极拳则是相当不错的慢节奏、静态发力的锻炼手段。</p>
<p>坐姿健身课程对于正处于运动损伤恢复期，或是行动能力受限的人来说，也不失为一种可能的锻炼手段。坐姿健身课程的动作，都是专门设计用来进行椅上锻炼的，可以在有限的活动范围内做出优美、得体的动作。一般这种坐姿健身课程都会配备健身教练。如果你因为伤病等原因，无法顺利完成预设的动作，健身教练也可以根据你的情况对动作进行定制改变。</p>


        
      </div>
    </div>
  </template>
  
  <script>
  export default {
    name: 'ArticleComponent',
    data() {
      return {
        fontSize: 16, // 初始字体大小
      };
    },
    methods: {
      increaseFontSize() {
        this.fontSize += 2;
      },
      decreaseFontSize() {
        if (this.fontSize > 12) {
          this.fontSize -= 2;
        }
      },
    },
  };
  </script>
  
  <style scoped>
  .article-container {
    max-width: 800px;
    margin: 0 auto;
    padding: 20px;
    background-color: #f9f9f9; /* 淡色背景 */
    text-align: center;
  }
  
  .title {
    font-weight: bold;
    margin-bottom: 20px;
  }
  
  .content {
    background-color: #ffffff;
    padding: 20px;
    border-radius: 8px;
    text-indent: 2em;
    text-align: left; /* 文字居左对齐，整个内容居中对齐 */
    position: relative;
  }
  
  .content::before,
  .content::after {
    content: "";
    position: absolute;
    top: 0;
    bottom: 0;
    width: 2px; /* 线条宽度 */
    background-color: #000; /* 线条颜色 */
  }
  
  .content::before {
    left: 0;
  }
  
  .content::after {
    right: 0;
  }
  
  .article-image {
    display: block;
    margin: 20px auto;
    max-width: 150%;
    height: auto;
  }
  
  .font-size-controls {
    margin-top: 20px;
  }
  
  button {
    margin: 5px;
    padding: 5px 10px;
    border: none;
    border-radius: 5px;
    background-color: #000000;
    color: #ffffff;
    cursor: pointer;
    transition: background-color 0.3s;
  }
  
  button:hover {
    background-color: #0056b3;
  }

  img {
    display: block;
    margin-left: 190px;
    max-width:60%;
    height: auto;
  }

  </style>
  